from django.shortcuts import render
from django.http import HttpResponse, JsonResponse

# Create your views here.
def home(request):
    context = {
        "articles": [
            {
                "title": "رونالدو، آماده شکستن رکورد شهریار ایران ",
                "description": "به گزارش ورزش سه، نام علی دایی در طول یک سال گذشته حتی بیش از زمانی که در زمین بازی حضور داشت و رکورد تاریخی خود را برای تیم ملی ایران ثبت می کرد، در سراسر جهان مطرح بوده است، چرا که تمام رسانه های ورزشی جهان مشغول گمانه زنی درباره این موضوع هستند که کریستیانو رونالدو چه زمانی رکورد علی دایی در بیشترین تعداد گل ملی را خواهد شکست.",
                "image": "https://static.farakav.com/files/pictures/thumb/01613680.jpg",
            },
            {
                "title": "رونالدو، آماده شکستن رکورد شهریار ایران ",
                "description": "به گزارش ورزش سه، نام علی دایی در طول یک سال گذشته حتی بیش از زمانی که در زمین بازی حضور داشت و رکورد تاریخی خود را برای تیم ملی ایران ثبت می کرد، در سراسر جهان مطرح بوده است، چرا که تمام رسانه های ورزشی جهان مشغول گمانه زنی درباره این موضوع هستند که کریستیانو رونالدو چه زمانی رکورد علی دایی در بیشترین تعداد گل ملی را خواهد شکست.",
                "image": "https://static.farakav.com/files/pictures/thumb/01613680.jpg",
            },
            {
                "title": " ایران در مقدماتی جام جهانی-سال‌های دور از خانه! ",
                "description": "همان‌طور که ایران در مرحله اول مقدماتی تنها میزبان مسابقه مقابل کامبوج، ضعیف‌ترین تیم گروه بود و 7 بازی دیگر خود را در خانه حریفان یا در زمین بی‌طرف برگزار کرد، در مرحله نهایی مسابقات نیز احتمال دارد که حتی در یک مسابقه هم ایران در شرایط میزبانی به میدان نرود؛ این در حالی است که ورزشگاه آزادی با حضور 100 هزار نفری هواداران فوتبال همیشه یکی از مهم‌ترین امتیازات ایران در رقابت‌های مقدماتی جام جهانی بوده است.",
                "image": "https://static.farakav.com/files/pictures/thumb/01613722.jpg",
            },
            {
                "title": " ایران در مقدماتی جام جهانی-سال‌های دور از خانه! ",
                "description": "همان‌طور که ایران در مرحله اول مقدماتی تنها میزبان مسابقه مقابل کامبوج، ضعیف‌ترین تیم گروه بود و 7 بازی دیگر خود را در خانه حریفان یا در زمین بی‌طرف برگزار کرد، در مرحله نهایی مسابقات نیز احتمال دارد که حتی در یک مسابقه هم ایران در شرایط میزبانی به میدان نرود؛ این در حالی است که ورزشگاه آزادی با حضور 100 هزار نفری هواداران فوتبال همیشه یکی از مهم‌ترین امتیازات ایران در رقابت‌های مقدماتی جام جهانی بوده است.",
                "image": "https://static.farakav.com/files/pictures/thumb/01613722.jpg",
            },
        ]
    }
    return render(request, "blog/home.html", context)
